/*
     - code 종류 -
       AD5 - 숙박 - blue
       FD6 - 음식점 - green
       CE7 - 카페 - beige
*/ 


const place_data = [
    {
        "x": "126.363608985425",
        "y": "33.237243150763",
        "name": "늘바다애견동반펜션",
        "phone": "1833-9306",
        "address_name": "제주특별자치도 서귀포시 안덕면 창천리 901-6",
        "code": "AD5"
    },
    {
        "x": "126.762269746755",
        "y": "33.2920459749967",
        "name": "스테이반하나 애견동반펜션",
        "phone": "010-2074-0948",
        "address_name": "제주특별자치도 서귀포시 남원읍 태흥리 46-2",
        "code": "AD5"
    },
    {
        "x": "126.4141337709822",
        "y": "33.2484470023073",
        "name": "씨사이드아덴리조트",
        "phone": "064-731-9800",
        "address_name": "제주특별자치도 서귀포시 색달동 2864-32",
        "code": "AD5"
    },
    {
        "x": "126.36583112477697",
        "y": "33.410402001717785",
        "name": "통나무파크",
        "phone": "064-799-6909",
        "address_name": "제주특별자치도 제주시 애월읍 납읍리 102",
        "code": "AD5"
    },
    {
        "x": "126.834937957589",
        "y": "33.3681817543382",
        "name": "휘게애견팬션",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 성산읍 신풍리 600-3",
        "code": "AD5"
    },
    {
        "x": "126.587278853649",
        "y": "33.2461387828309",
        "name": "라임오렌지빌",
        "phone": "064-767-3888",
        "address_name": "제주특별자치도 서귀포시 토평동 416",
        "code": "AD5"
    },
    {
        "x": "126.52373372642265",
        "y": "33.50721989496874",
        "name": "아라팰리스호텔",
        "phone": "064-722-2788",
        "address_name": "제주특별자치도 제주시 삼도이동 228-32",
        "code": "AD5"
    },
    {
        "x": "126.42778368528352",
        "y": "33.26545653458881",
        "name": "제주에코스위츠",
        "phone": "064-738-9975",
        "address_name": "제주특별자치도 서귀포시 중문동 944-5",
        "code": "AD5"
    },
    {
        "x": "126.601037980358",
        "y": "33.3257288024716",
        "name": "예이츠산장",
        "phone": "064-767-3846",
        "address_name": "제주특별자치도 서귀포시 남원읍 하례리 1876-1",
        "code": "AD5"
    },
    {
        "x": "126.22493000358233",
        "y": "33.38819540081229",
        "name": "마레카펜션",
        "phone": "010-7283-1475",
        "address_name": "제주특별자치도 제주시 한림읍 금능리 1682-5",
        "code": "AD5"
    },
    {
        "x": "126.44668990628153",
        "y": "33.243372093041245",
        "name": "뷰티플하우스",
        "phone": "064-738-7407",
        "address_name": "제주특별자치도 서귀포시 대포동 1266",
        "code": "AD5"
    },
    {
        "x": "126.90179629537045",
        "y": "33.48598546517234",
        "name": "솔펜션",
        "phone": "0507-1474-0239",
        "address_name": "제주특별자치도 제주시 구좌읍 종달리 722",
        "code": "AD5"
    },
    {
        "x": "126.90743319793769",
        "y": "33.45492038317763",
        "name": "제주다온재",
        "phone": "064-784-5090",
        "address_name": "제주특별자치도 서귀포시 성산읍 오조리 1065-12",
        "code": "AD5"
    },
    {
        "x": "126.385693882976",
        "y": "33.2421327739963",
        "name": "씨에나펜션",
        "phone": "064-739-6623",
        "address_name": "제주특별자치도 서귀포시 하예동 351-4",
        "code": "AD5"
    },
    {
        "x": "126.89975655191883",
        "y": "33.50913071741252",
        "name": "크리스마스리조트",
        "phone": "064-733-5212",
        "address_name": "제주특별자치도 제주시 구좌읍 종달리 1422",
        "code": "AD5"
    },
    {
        "x": "126.363519961967",
        "y": "33.2370912230675",
        "name": "늘바다통나무펜션",
        "phone": "010-9061-3169",
        "address_name": "제주특별자치도 서귀포시 안덕면 창천리 901-6",
        "code": "AD5"
    },
    {
        "x": "126.53354990834",
        "y": "33.5030450044546",
        "name": "애플호텔",
        "phone": "064-725-1552",
        "address_name": "제주특별자치도 제주시 이도1동 1244-7",
        "code": "AD5"
    },
    {
        "x": "126.509931891558",
        "y": "33.2420531931958",
        "name": "앙크레펜션",
        "phone": "064-738-8890",
        "address_name": "제주특별자치도 서귀포시 법환동 1027",
        "code": "AD5"
    },
    {
        "x": "126.35581259666962",
        "y": "33.26102376627135",
        "name": "웨스티하우스",
        "phone": "064-792-2933",
        "address_name": "제주특별자치도 서귀포시 안덕면 감산리 210-5",
        "code": "AD5"
    },
    {
        "x": "126.3249561661",
        "y": "33.2420271360949",
        "name": "오션브릭풀빌라",
        "phone": "064-792-4100",
        "address_name": "제주특별자치도 서귀포시 안덕면 화순리 2021",
        "code": "AD5"
    },
    {
        "x": "126.309750296371",
        "y": "33.2349074667293",
        "name": "바다스케치",
        "phone": "064-794-0030",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 150",
        "code": "AD5"
    },
    {
        "x": "126.36675746202916",
        "y": "33.449390704672915",
        "name": "오렌지슈가펜션",
        "phone": "064-799-7772",
        "address_name": "제주특별자치도 제주시 애월읍 하가리 120-49",
        "code": "AD5"
    },
    {
        "x": "126.84411488192542",
        "y": "33.43058195761508",
        "name": "샤론의집펜션",
        "phone": "010-8676-5948",
        "address_name": "제주특별자치도 서귀포시 성산읍 수산리 3988-9",
        "code": "AD5"
    },
    {
        "x": "126.40140578718432",
        "y": "33.2587577329975",
        "name": "제주행복스케치펜션",
        "phone": "064-738-3720",
        "address_name": "제주특별자치도 서귀포시 상예동 283",
        "code": "AD5"
    },
    {
        "x": "126.29553137803309",
        "y": "33.23077408818657",
        "name": "쉬다가게",
        "phone": "010-8706-3606",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 2501-1",
        "code": "AD5"
    },
    {
        "x": "126.794254260936",
        "y": "33.5583349288293",
        "name": "섯동네펜션",
        "phone": "010-7761-4517",
        "address_name": "제주특별자치도 제주시 구좌읍 월정리 659-1",
        "code": "AD5"
    },
    {
        "x": "126.282089220675",
        "y": "33.3463625749963",
        "name": "제주힐링리조트",
        "phone": "010-5415-9045",
        "address_name": "제주특별자치도 제주시 한림읍 금악리 3399",
        "code": "AD5"
    },
    {
        "x": "126.934831594063",
        "y": "33.4642875072665",
        "name": "바라봄",
        "phone": "010-9633-7072",
        "address_name": "제주특별자치도 서귀포시 성산읍 성산리 224-2",
        "code": "AD5"
    },
    {
        "x": "126.8076566194639",
        "y": "33.397428888296396",
        "name": "타이스토리",
        "phone": "064-787-4667",
        "address_name": "제주특별자치도 서귀포시 표선면 성읍리 458",
        "code": "AD5"
    },
    {
        "x": "126.29973019846501",
        "y": "33.239548878430675",
        "name": "달콤한소금만들기",
        "phone": "010-2875-8250",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 1545-1",
        "code": "AD5"
    },
    {
        "x": "126.583409853951",
        "y": "33.2483258649445",
        "name": "포시즌펜션",
        "phone": "064-732-5222",
        "address_name": "제주특별자치도 서귀포시 토평동 636",
        "code": "AD5"
    },
    {
        "x": "126.379460586078",
        "y": "33.4162708880183",
        "name": "멍멍플레이스",
        "phone": "0507-1307-4661",
        "address_name": "제주특별자치도 제주시 애월읍 소길리 952-2",
        "code": "AD5"
    },
    {
        "x": "126.58963352730993",
        "y": "33.249259007285694",
        "name": "비울채울펜션",
        "phone": "064-732-0388",
        "address_name": "제주특별자치도 서귀포시 보목동 1569",
        "code": "AD5"
    },
    {
        "x": "126.62437499094037",
        "y": "33.25885937055316",
        "name": "쇠소깍천일펜션",
        "phone": "1644-9565",
        "address_name": "제주특별자치도 서귀포시 남원읍 하례리 158-4",
        "code": "AD5"
    },
    {
        "x": "126.41606454600206",
        "y": "33.281455367763364",
        "name": "라벤더스호텔앤리조트",
        "phone": "064-739-0770",
        "address_name": "제주특별자치도 서귀포시 색달동 663",
        "code": "AD5"
    },
    {
        "x": "126.58165877329702",
        "y": "33.2507715223935",
        "name": "옛마을펜션",
        "phone": "064-733-5359",
        "address_name": "제주특별자치도 서귀포시 토평동 779-1",
        "code": "AD5"
    },
    {
        "x": "126.267470130405",
        "y": "33.3839061570874",
        "name": "메이플해피하우스",
        "phone": "064-796-4320",
        "address_name": "제주특별자치도 제주시 한림읍 명월리 1619-2",
        "code": "AD5"
    },
    {
        "x": "126.35777722872983",
        "y": "33.472398115475976",
        "name": "엔젤하우스",
        "phone": "010-4894-9388",
        "address_name": "제주특별자치도 제주시 애월읍 고내리 11-1",
        "code": "AD5"
    },
    {
        "x": "126.581361968166",
        "y": "33.2493288155142",
        "name": "채우리네펜션",
        "phone": "010-9321-5380",
        "address_name": "제주특별자치도 서귀포시 토평동 610-9",
        "code": "AD5"
    },
    {
        "x": "126.760546591626",
        "y": "33.3301599245091",
        "name": "아름다운호야네",
        "phone": "010-2162-3699",
        "address_name": "제주특별자치도 서귀포시 표선면 토산리 1790",
        "code": "AD5"
    },
    {
        "x": "126.81498898155063",
        "y": "33.40277670823164",
        "name": "제주블루앤씨펜션",
        "phone": "064-787-1910",
        "address_name": "제주특별자치도 서귀포시 성산읍 삼달리 1991",
        "code": "AD5"
    },
    {
        "x": "126.302275866522",
        "y": "33.4228390930314",
        "name": "귀덕귀덕펜션",
        "phone": "010-8802-5928",
        "address_name": "제주특별자치도 제주시 한림읍 귀덕리 34-13",
        "code": "AD5"
    },
    {
        "x": "126.498193725234",
        "y": "33.5174350621195",
        "name": "하얀등대펜션",
        "phone": "010-6798-0567",
        "address_name": "제주특별자치도 제주시 용담삼동 1206",
        "code": "AD5"
    },
    {
        "x": "126.803954599564",
        "y": "33.5565366628491",
        "name": "바람의언덕펜션",
        "phone": "0503-5057-0344",
        "address_name": "제주특별자치도 제주시 구좌읍 행원리 1501",
        "code": "AD5"
    },
    {
        "x": "126.36806287996454",
        "y": "33.24242763355721",
        "name": "제주다와풀빌라펜션",
        "phone": "1833-9306",
        "address_name": "제주특별자치도 서귀포시 안덕면 창천리 705-7",
        "code": "AD5"
    },
    {
        "x": "126.74663069694",
        "y": "33.2827246638257",
        "name": "동상일몽",
        "phone": "010-9040-5090",
        "address_name": "제주특별자치도 서귀포시 남원읍 태흥리 1148-2",
        "code": "AD5"
    },
    {
        "x": "126.25111310911919",
        "y": "33.375271370058265",
        "name": "에퀴녹스 협재",
        "phone": "064-796-9388",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 899",
        "code": "AD5"
    },
    {
        "x": "126.6387551242765",
        "y": "33.48206819907232",
        "name": "제주레포츠랜드",
        "phone": "064-784-8800",
        "address_name": "제주특별자치도 제주시 조천읍 와흘리 870",
        "code": "AT4"
    },
    {
        "x": "126.581068108955",
        "y": "33.2506442074029",
        "name": "시루네펜션",
        "phone": "010-7163-2205",
        "address_name": "제주특별자치도 서귀포시 토평동 781-7",
        "code": "AD5"
    },
    {
        "x": "126.86640252954405",
        "y": "33.52396032977088",
        "name": "하도바다펜션",
        "phone": "010-5808-9228",
        "address_name": "제주특별자치도 제주시 구좌읍 하도리 3359-74",
        "code": "AD5"
    },
    {
        "x": "126.9039398337918",
        "y": "33.40690137196326",
        "name": "성산별장펜션",
        "phone": "010-2088-9450",
        "address_name": "제주특별자치도 서귀포시 성산읍 온평리 764-3",
        "code": "AD5"
    },
    {
        "x": "126.184253214628",
        "y": "33.304321205289",
        "name": "엉알게스트하우스",
        "phone": "",
        "address_name": "제주특별자치도 제주시 한경면 고산리 2162-12",
        "code": "AD5"
    },
    {
        "x": "126.825494680785",
        "y": "33.4091852897688",
        "name": "기차펜션",
        "phone": "010-8663-7087",
        "address_name": "제주특별자치도 서귀포시 성산읍 난산리 2958-5",
        "code": "AD5"
    },
    {
        "x": "126.33942597173987",
        "y": "33.46705264634009",
        "name": "글로리아펜션",
        "phone": "064-799-7773",
        "address_name": "제주특별자치도 제주시 애월읍 고내리 577",
        "code": "AD5"
    },
    {
        "x": "126.88875649068441",
        "y": "33.38905196736248",
        "name": "일해펜션",
        "phone": "010-4100-1045",
        "address_name": "제주특별자치도 서귀포시 성산읍 신산리 64-9",
        "code": "AD5"
    },
    {
        "x": "126.36565282423412",
        "y": "33.23947878936478",
        "name": "제이큐브펜션",
        "phone": "1833-9306",
        "address_name": "제주특별자치도 서귀포시 안덕면 창천리 930-2",
        "code": "AD5"
    },
    {
        "x": "126.253157306705",
        "y": "33.401751669615",
        "name": "내안에제주",
        "phone": "010-7283-1475",
        "address_name": "제주특별자치도 제주시 한림읍 옹포리 627-6",
        "code": "AD5"
    },
    {
        "x": "126.92000559493127",
        "y": "33.44010122570807",
        "name": "백록베이스볼타운",
        "phone": "064-735-1800",
        "address_name": "제주특별자치도 서귀포시 성산읍 고성리 448-1",
        "code": "AD5"
    },
    {
        "x": "126.944663920433",
        "y": "33.4994856091739",
        "name": "하늘이펜션",
        "phone": "064-783-0235",
        "address_name": "제주특별자치도 제주시 우도면 연평리 2587",
        "code": "AD5"
    },
    {
        "x": "126.593157400484",
        "y": "33.243720137222",
        "name": "향림원펜션",
        "phone": "064-733-5799",
        "address_name": "제주특별자치도 서귀포시 보목동 1239-4",
        "code": "AD5"
    },
    {
        "x": "126.265998403246",
        "y": "33.3866473167521",
        "name": "명월민박",
        "phone": "010-8401-1719",
        "address_name": "제주특별자치도 제주시 한림읍 명월리 1719-1",
        "code": "AD5"
    },
    {
        "x": "126.762308308194",
        "y": "33.2920785074839",
        "name": "스테이반하나여기라면",
        "phone": "010-2228-4306",
        "address_name": "제주특별자치도 서귀포시 남원읍 태흥리 46-2",
        "code": "FD6"
    },
    {
        "x": "126.33639304521911",
        "y": "33.24385224592884",
        "name": "개스트하우스말",
        "phone": "010-3158-9397",
        "address_name": "제주특별자치도 서귀포시 안덕면 화순리 365-3",
        "code": "AD5"
    },
    {
        "x": "126.426037323122",
        "y": "33.4484765511391",
        "name": "맨도롱하우스",
        "phone": "010-5508-8594",
        "address_name": "제주특별자치도 제주시 애월읍 광령리 3166-1",
        "code": "AD5"
    },
    {
        "x": "126.905195896649",
        "y": "33.3985731901268",
        "name": "쉐프1192펜션",
        "phone": "064-783-1193",
        "address_name": "제주특별자치도 서귀포시 성산읍 온평리 1192-3",
        "code": "AD5"
    },
    {
        "x": "126.299801125476",
        "y": "33.2372465520566",
        "name": "펠리체펜션",
        "phone": "010-4015-1585",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 1585",
        "code": "AD5"
    },
    {
        "x": "126.74484865260668",
        "y": "33.28827777708188",
        "name": "모든날이행복하기를",
        "phone": "010-8641-8406",
        "address_name": "제주특별자치도 서귀포시 남원읍 태흥리 568",
        "code": "AD5"
    },
    {
        "x": "126.336183215762",
        "y": "33.466272582518",
        "name": "장군의집",
        "phone": "010-8660-0505",
        "address_name": "제주특별자치도 제주시 애월읍 고내리 1181-1",
        "code": "AD5"
    },
    {
        "x": "126.30488611623508",
        "y": "33.24247018141216",
        "name": "리조트라온제나",
        "phone": "010-7119-3185",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 385-1",
        "code": "AD5"
    },
    {
        "x": "126.248160451677",
        "y": "33.3103611257355",
        "name": "비마이아일",
        "phone": "010-3996-3596",
        "address_name": "제주특별자치도 제주시 한경면 청수리 1323-1",
        "code": "AD5"
    },
    {
        "x": "126.60389740997861",
        "y": "33.24031867964926",
        "name": "바닷가에서 펜션",
        "phone": "064-732-6898",
        "address_name": "제주특별자치도 서귀포시 보목동 437-5",
        "code": "AD5"
    },
    {
        "x": "126.390158853774",
        "y": "33.4760706421865",
        "name": "쿠시쿠시하우스",
        "phone": "010-3718-3280",
        "address_name": "제주특별자치도 제주시 애월읍 하귀2리 2999-1",
        "code": "AD5"
    },
    {
        "x": "126.476896847731",
        "y": "33.4397324474905",
        "name": "제주 포레스타 힐",
        "phone": "1668-2673",
        "address_name": "제주특별자치도 제주시 해안동 403-14",
        "code": "AD5"
    },
    {
        "x": "126.602816464893",
        "y": "33.2394740086156",
        "name": "더코지인제주",
        "phone": "070-4548-3910",
        "address_name": "제주특별자치도 서귀포시 보목동 583",
        "code": "AD5"
    },
    {
        "x": "126.23383745405353",
        "y": "33.29202883134245",
        "name": "제주애단비",
        "phone": "010-3957-9782",
        "address_name": "제주특별자치도 제주시 한경면 청수리 3152",
        "code": "AD5"
    },
    {
        "x": "126.2955708289384",
        "y": "33.41088218348006",
        "name": "오데뜨",
        "phone": "064-799-2748",
        "address_name": "제주특별자치도 제주시 한림읍 상대리 2887",
        "code": "FD6"
    },
    {
        "x": "126.794061435543",
        "y": "33.3832534709324",
        "name": "신토불이식당",
        "phone": "064-787-4450",
        "address_name": "제주특별자치도 서귀포시 표선면 성읍리 1380-3",
        "code": "FD6"
    },
    {
        "x": "126.4357846806834",
        "y": "33.461259002791635",
        "name": "고추냉이식당",
        "phone": "064-748-4145",
        "address_name": "제주특별자치도 제주시 애월읍 광령리 2213-1",
        "code": "FD6"
    },
    {
        "x": "126.438734147256",
        "y": "33.2392710208562",
        "name": "산내들식당",
        "phone": "064-738-1129",
        "address_name": "제주특별자치도 서귀포시 대포동 2183",
        "code": "FD6"
    },
    {
        "x": "126.43170029607377",
        "y": "33.49373365757327",
        "name": "외도339",
        "phone": "064-748-0339",
        "address_name": "제주특별자치도 제주시 외도이동 339",
        "code": "CE7"
    },
    {
        "x": "126.263889970387",
        "y": "33.3960600579083",
        "name": "외쿡식당",
        "phone": "064-796-2058",
        "address_name": "제주특별자치도 제주시 한림읍 동명리 2222",
        "code": "FD6"
    },
    {
        "x": "126.790794863817",
        "y": "33.5531575884987",
        "name": "달이뜨는식탁",
        "phone": "064-782-8538",
        "address_name": "제주특별자치도 제주시 구좌읍 월정리 885",
        "code": "FD6"
    },
    {
        "x": "126.8278472011442",
        "y": "33.5428463007221",
        "name": "오누이",
        "phone": "064-782-6801",
        "address_name": "제주특별자치도 제주시 구좌읍 한동리 1388-1",
        "code": "FD6"
    },
    {
        "x": "126.80640163857548",
        "y": "33.55635478519352",
        "name": "그초록",
        "phone": "010-7777-4244",
        "address_name": "제주특별자치도 제주시 구좌읍 행원리 1485-8",
        "code": "CE7"
    },
    {
        "x": "126.40767702404784",
        "y": "33.48505607635867",
        "name": "씨사이드 애월하귀점",
        "phone": "010-9932-9072",
        "address_name": "제주특별자치도 제주시 애월읍 하귀1리 1612",
        "code": "CE7"
    },
    {
        "x": "126.676999059308",
        "y": "33.2760210014731",
        "name": "동박낭",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 남원읍 위미리 956-3",
        "code": "CE7"
    },
    {
        "x": "126.49459941750798",
        "y": "33.49508807277879",
        "name": "제니의정원",
        "phone": "064-742-0649",
        "address_name": "제주특별자치도 제주시 연동 1934-1",
        "code": "FD6"
    },
    {
        "x": "126.302290416798",
        "y": "33.246951098309",
        "name": "신옛촌 본점",
        "phone": "064-794-1688",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 863-7",
        "code": "FD6"
    },
    {
        "x": "126.527675697577",
        "y": "33.47377864639875",
        "name": "탐나버거",
        "phone": "070-4038-0410",
        "address_name": "제주특별자치도 제주시 오등동 688-5",
        "code": "FD6"
    },
    {
        "x": "126.302062662303",
        "y": "33.4483996967658",
        "name": "심바카레",
        "phone": "064-799-4164",
        "address_name": "제주특별자치도 제주시 애월읍 금성리 472-5",
        "code": "FD6"
    },
    {
        "x": "126.241083771309",
        "y": "33.3918691333548",
        "name": "돼지굽는정원",
        "phone": "064-796-7531",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 2528",
        "code": "FD6"
    },
    {
        "x": "126.246757811701",
        "y": "33.3989469138154",
        "name": "어애랑",
        "phone": "064-796-9253",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 1510",
        "code": "FD6"
    },
    {
        "x": "126.67265067446611",
        "y": "33.542854250199674",
        "name": "함덕해물라면오빠집",
        "phone": "064-784-6327",
        "address_name": "제주특별자치도 제주시 조천읍 함덕리 228-1",
        "code": "FD6"
    },
    {
        "x": "126.307753724764",
        "y": "33.2546381354201",
        "name": "덕수아이흑돼지",
        "phone": "064-794-8293",
        "address_name": "제주특별자치도 서귀포시 안덕면 덕수리 2213-1",
        "code": "FD6"
    },
    {
        "x": "126.50578142516332",
        "y": "33.254288086210956",
        "name": "봉꾸라주",
        "phone": "070-8866-1229",
        "address_name": "제주특별자치도 서귀포시 강정동 152-3",
        "code": "CE7"
    },
    {
        "x": "126.31520826145932",
        "y": "33.46333833285457",
        "name": "인디안썸머",
        "phone": "064-799-8444",
        "address_name": "제주특별자치도 제주시 애월읍 애월리 2127-10",
        "code": "FD6"
    },
    {
        "x": "126.65721564391333",
        "y": "33.47342198226229",
        "name": "도을",
        "phone": "070-8844-0828",
        "address_name": "제주특별자치도 제주시 조천읍 와흘리 125",
        "code": "CE7"
    },
    {
        "x": "126.84356930639566",
        "y": "33.32575883455676",
        "name": "당포로나인돈카츠",
        "phone": "070-8900-8285",
        "address_name": "제주특별자치도 서귀포시 표선면 표선리 43-1",
        "code": "FD6"
    },
    {
        "x": "126.171233164365",
        "y": "33.3417845716197",
        "name": "카페파람",
        "phone": "010-8520-0702",
        "address_name": "제주특별자치도 제주시 한경면 신창리 1353-1",
        "code": "CE7"
    },
    {
        "x": "126.87973368187009",
        "y": "33.378833781483166",
        "name": "제이아일랜드카페",
        "phone": "064-782-7077",
        "address_name": "제주특별자치도 서귀포시 성산읍 신산리 421-1",
        "code": "CE7"
    },
    {
        "x": "126.1759331835639",
        "y": "33.34321150939524",
        "name": "와랑식탁",
        "phone": "010-4166-9501",
        "address_name": "제주특별자치도 제주시 한경면 신창리 1317-1",
        "code": "FD6"
    },
    {
        "x": "126.64102908256382",
        "y": "33.26481425145401",
        "name": "호꼼스낵",
        "phone": "070-4132-5533",
        "address_name": "제주특별자치도 서귀포시 남원읍 신례리 58-1",
        "code": "FD6"
    },
    {
        "x": "126.862901885372",
        "y": "33.4392632362505",
        "name": "금백조로가든",
        "phone": "064-782-2055",
        "address_name": "제주특별자치도 서귀포시 성산읍 수산리 2462-1",
        "code": "FD6"
    },
    {
        "x": "126.24152105744949",
        "y": "33.39300059581983",
        "name": "배롱정원",
        "phone": "064-796-7766",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 2518",
        "code": "CE7"
    },
    {
        "x": "126.3128538010942",
        "y": "33.2352230845872",
        "name": "산방산해물라면오빠네",
        "phone": "010-8834-1798",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 171",
        "code": "FD6"
    },
    {
        "x": "126.910890423896",
        "y": "33.4610105874904",
        "name": "플라이오조",
        "phone": "064-783-2454",
        "address_name": "제주특별자치도 서귀포시 성산읍 오조리 792-1",
        "code": "CE7"
    },
    {
        "x": "126.25121062823803",
        "y": "33.380067524038836",
        "name": "소금빵까페 키친오즈",
        "phone": "064-796-7165",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 958-1",
        "code": "CE7"
    },
    {
        "x": "126.18346224715",
        "y": "33.3444693732521",
        "name": "일루올레",
        "phone": "0507-1421-5514",
        "address_name": "제주특별자치도 제주시 한경면 신창리 695-2",
        "code": "CE7"
    },
    {
        "x": "126.4843769197419",
        "y": "33.47142513609775",
        "name": "스시혼",
        "phone": "064-742-7006",
        "address_name": "제주특별자치도 제주시 노형동 88-16",
        "code": "FD6"
    },
    {
        "x": "126.3115349977728",
        "y": "33.416341677084354",
        "name": "봉성프리마",
        "phone": "010-2011-4430",
        "address_name": "제주특별자치도 제주시 애월읍 봉성리 4086",
        "code": "CE7"
    },
    {
        "x": "126.396809354275",
        "y": "33.4341828015227",
        "name": "카페호나",
        "phone": "064-799-9114",
        "address_name": "제주특별자치도 제주시 애월읍 유수암리 2411",
        "code": "CE7"
    },
    {
        "x": "126.59281408922682",
        "y": "33.529584070123356",
        "name": "카페비비",
        "phone": "010-2659-8363",
        "address_name": "제주특별자치도 제주시 삼양일동 1577-14",
        "code": "CE7"
    },
    {
        "x": "126.382479135142",
        "y": "33.3072550179351",
        "name": "모록밭",
        "phone": "064-792-6080",
        "address_name": "제주특별자치도 서귀포시 안덕면 상천리 470-10",
        "code": "FD6"
    },
    {
        "x": "126.1992930546226",
        "y": "33.364975446976956",
        "name": "짚불도",
        "phone": "064-772-1919",
        "address_name": "제주특별자치도 제주시 한경면 판포리 2872",
        "code": "FD6"
    },
    {
        "x": "126.243401968193",
        "y": "33.3969700511556",
        "name": "온다정",
        "phone": "",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 1651",
        "code": "FD6"
    },
    {
        "x": "126.177372906705",
        "y": "33.3029450909818",
        "name": "제주찰리아저씨",
        "phone": "064-773-0145",
        "address_name": "제주특별자치도 제주시 한경면 고산리 2768-2",
        "code": "FD6"
    },
    {
        "x": "126.247189813485",
        "y": "33.3989585513561",
        "name": "제주달빛좋은밤",
        "phone": "010-9025-1584",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 1512",
        "code": "FD6"
    },
    {
        "x": "126.338913773455",
        "y": "33.2482331036319",
        "name": "초밥충전",
        "phone": "010-9969-3844",
        "address_name": "제주특별자치도 서귀포시 안덕면 화순리 240-7",
        "code": "FD6"
    },
    {
        "x": "126.24911947967898",
        "y": "33.3881800245334",
        "name": "니나노제주",
        "phone": "064-900-7796",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 1076-1",
        "code": ""
    },
    {
        "x": "126.249077231394",
        "y": "33.3081343052879",
        "name": "곶자왈보석상자",
        "phone": "",
        "address_name": "제주특별자치도 제주시 한경면 청수리 1245-2",
        "code": "CE7"
    },
    {
        "x": "126.522671086285",
        "y": "33.4992529481874",
        "name": "이태리너랑같이제주",
        "phone": "064-724-7335",
        "address_name": "제주특별자치도 제주시 삼도일동 579-18",
        "code": "FD6"
    },
    {
        "x": "126.2415296825643",
        "y": "33.393739951146955",
        "name": "홍대부부",
        "phone": "",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 1750",
        "code": "FD6"
    },
    {
        "x": "126.905195896649",
        "y": "33.3985731901268",
        "name": "쉐프1192펜션",
        "phone": "064-783-1193",
        "address_name": "제주특별자치도 서귀포시 성산읍 온평리 1192-3",
        "code": "AD5"
    },
    {
        "x": "126.65562876518341",
        "y": "33.53918909090022",
        "name": "카페35351",
        "phone": "",
        "address_name": "제주특별자치도 제주시 조천읍 함덕리 3535-1",
        "code": "CE7"
    },
    {
        "x": "126.514306645744",
        "y": "33.2354154265633",
        "name": "와룽발리",
        "phone": "064-739-7959",
        "address_name": "제주특별자치도 서귀포시 법환동 161-6",
        "code": "FD6"
    },
    {
        "x": "126.5030228060279",
        "y": "33.253650461948006",
        "name": "세이모키친",
        "phone": "0507-1433-5447",
        "address_name": "제주특별자치도 서귀포시 강정동 192",
        "code": "FD6"
    },
    {
        "x": "126.290997370856",
        "y": "33.2084639544743",
        "name": "송악산해물라면오빠네본가",
        "phone": "064-794-0171",
        "address_name": "제주특별자치도 서귀포시 대정읍 상모리 126-7",
        "code": "FD6"
    },
    {
        "x": "126.95885901159",
        "y": "33.5119512956755",
        "name": "범선집밥",
        "phone": "064-784-0993",
        "address_name": "제주특별자치도 제주시 우도면 연평리 677-1",
        "code": "FD6"
    },
    {
        "x": "126.70764834527",
        "y": "33.504820528254",
        "name": "제주그리미",
        "phone": "070-8900-0768",
        "address_name": "제주특별자치도 제주시 조천읍 선흘리 1393",
        "code": "FD6"
    },
    {
        "x": "126.57533309273948",
        "y": "33.24651963039122",
        "name": "돈스타",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 동홍동 253-3",
        "code": "FD6"
    },
    {
        "x": "126.2765902585718",
        "y": "33.421620868950164",
        "name": "브레이브독스",
        "phone": "010-4404-4026",
        "address_name": "제주특별자치도 제주시 한림읍 대림리 428-13",
        "code": ""
    },
    {
        "x": "126.65996334669826",
        "y": "33.52625959737024",
        "name": "함덕카페H",
        "phone": "064-784-9234",
        "address_name": "제주특별자치도 제주시 조천읍 함덕리 2255",
        "code": "CE7"
    },
    {
        "x": "126.901792094938",
        "y": "33.4859890682676",
        "name": "돌담넘는고양이",
        "phone": "",
        "address_name": "제주특별자치도 제주시 구좌읍 종달리 722",
        "code": "FD6"
    },
    {
        "x": "126.30350819418885",
        "y": "33.26048933904923",
        "name": "수지네카페 (휴업중)",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 안덕면 덕수리 2117",
        "code": "CE7"
    },
    {
        "x": "126.802453919749",
        "y": "33.3846880636678",
        "name": "연집",
        "phone": "010-8784-6222",
        "address_name": "제주특별자치도 서귀포시 표선면 성읍리 987",
        "code": "FD6"
    },
    {
        "x": "126.647325233141",
        "y": "33.5363870140246",
        "name": "999 휴게쉼터",
        "phone": "010-5577-7468",
        "address_name": "제주특별자치도 제주시 조천읍 조천리 674",
        "code": "FD6"
    },
    {
        "x": "126.181299981274",
        "y": "33.3513441851086",
        "name": "두모토랑",
        "phone": "0507-1353-3916",
        "address_name": "제주특별자치도 제주시 한경면 두모리 2802",
        "code": "FD6"
    },
    {
        "x": "126.836498840716",
        "y": "33.3264484919187",
        "name": "기장수월바다장어구이",
        "phone": "064-787-1787",
        "address_name": "제주특별자치도 서귀포시 표선면 표선리 483",
        "code": "FD6"
    },
    {
        "x": "126.792271203064",
        "y": "33.5527002611793",
        "name": "예쁘게즐겁게",
        "phone": "",
        "address_name": "제주특별자치도 제주시 구좌읍 월정리 278",
        "code": "FD6"
    },
    {
        "x": "126.22819624866",
        "y": "33.3379240663366",
        "name": "아일랜드오아시스",
        "phone": "010-9947-5960",
        "address_name": "제주특별자치도 제주시 한경면 조수리 368-1",
        "code": "FD6"
    },
    {
        "x": "126.498203511192",
        "y": "33.5174179715849",
        "name": "오멍가멍",
        "phone": "",
        "address_name": "제주특별자치도 제주시 용담삼동 1206",
        "code": "CE7"
    },
    {
        "x": "126.52846808706556",
        "y": "33.50107111670431",
        "name": "퍼펫",
        "phone": "064-702-2310",
        "address_name": "제주특별자치도 제주시 이도일동 1774-19",
        "code": "CE7"
    },
    {
        "x": "126.494459249974",
        "y": "33.4895805789203",
        "name": "도그헤븐",
        "phone": "064-901-9209",
        "address_name": "제주특별자치도 제주시 연동 292-10",
        "code": "CE7"
    },
    {
        "x": "126.392863437642",
        "y": "33.4121718292327",
        "name": "멍포레스트",
        "phone": "070-8900-5450",
        "address_name": "제주특별자치도 제주시 애월읍 소길리 155-97",
        "code": "CE7"
    },
    {
        "x": "126.673073839364",
        "y": "33.5153855899545",
        "name": "도그모루",
        "phone": "010-5947-1023",
        "address_name": "제주특별자치도 제주시 조천읍 대흘리 101-2",
        "code": "CE7"
    },
    {
        "x": "126.591529070002",
        "y": "33.516229063384",
        "name": "카이터스",
        "phone": "010-6646-3302",
        "address_name": "제주특별자치도 제주시 도련이동 607",
        "code": "CE7"
    },
    {
        "x": "126.334070519481",
        "y": "33.443757642348",
        "name": "달래애견카페",
        "phone": "064-805-8777",
        "address_name": "제주특별자치도 제주시 애월읍 납읍리 914-2",
        "code": "CE7"
    },
    {
        "x": "126.51954780206503",
        "y": "33.50982916467087",
        "name": "몽스파 본점",
        "phone": "064-803-0661",
        "address_name": "제주특별자치도 제주시 삼도일동 751-1",
        "code": "CE7"
    },
    {
        "x": "126.555911617476",
        "y": "33.2657295302995",
        "name": "놀멍쉬멍고르멍",
        "phone": "0507-1409-2405",
        "address_name": "제주특별자치도 서귀포시 서홍동 136-1",
        "code": "CE7"
    },
    {
        "x": "126.631425991124",
        "y": "33.2802869797121",
        "name": "개판오분전",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 남원읍 신례리 697-9",
        "code": "CE7"
    },
    {
        "x": "126.3155320672",
        "y": "33.3041002783409",
        "name": "애니멀고파크 제주신화월드점",
        "phone": "0507-1335-5659",
        "address_name": "제주특별자치도 서귀포시 안덕면 서광리 산 24-11",
        "code": "CE7"
    },
    {
        "x": "126.459353627736",
        "y": "33.4794463733711",
        "name": "강생아 내가너를사랑해",
        "phone": "070-4135-4135",
        "address_name": "제주특별자치도 제주시 도평동 6",
        "code": "CE7"
    },
    {
        "x": "126.442778673691",
        "y": "33.2525322619809",
        "name": "그루밍제주",
        "phone": "064-738-7577",
        "address_name": "제주특별자치도 서귀포시 회수동 556",
        "code": "CE7"
    },
    {
        "x": "126.304886116235",
        "y": "33.2424701814122",
        "name": "카페왈 사계점",
        "phone": "010-3311-5437",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 385-1",
        "code": "CE7"
    },
    {
        "x": "126.548906945274",
        "y": "33.4922908578637",
        "name": "러블리독스",
        "phone": "",
        "address_name": "제주특별자치도 제주시 이도이동 122-1",
        "code": "CE7"
    },
    {
        "x": "126.347375229226",
        "y": "33.4714097415227",
        "name": "앙앙",
        "phone": "",
        "address_name": "제주특별자치도 제주시 애월읍 고내리 365-2",
        "code": "CE7"
    },
    {
        "x": "126.267515515935",
        "y": "33.3369405185144",
        "name": "별애별개",
        "phone": "070-4063-0712",
        "address_name": "제주특별자치도 제주시 한경면 저지리 2120-144",
        "code": "CE7"
    },
    {
        "x": "126.506929521028",
        "y": "33.2554611517777",
        "name": "마이리틀펫",
        "phone": "064-739-7380",
        "address_name": "제주특별자치도 서귀포시 강정동 148-6",
        "code": "CE7"
    },
    {
        "x": "126.442294941715",
        "y": "33.4894181043232",
        "name": "델루나쥬쥬",
        "phone": "064-749-1701",
        "address_name": "제주특별자치도 제주시 내도동 239-1",
        "code": "CE7"
    },
    {
        "x": "126.304822282319",
        "y": "33.2827736975683",
        "name": "펫소풍",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 안덕면 서광리 2188-1",
        "code": "CE7"
    },
    {
        "x": "126.493524563193",
        "y": "33.4911797928058",
        "name": "쁘띠레브",
        "phone": "",
        "address_name": "제주특별자치도 제주시 연동 291-66",
        "code": "CE7"
    },
    {
        "x": "126.55973016319794",
        "y": "33.259341549427575",
        "name": "개다방",
        "phone": "064-733-0166",
        "address_name": "제주특별자치도 서귀포시 동홍동 1554-4",
        "code": "CE7"
    },
    {
        "x": "126.31793636017",
        "y": "33.2793733442099",
        "name": "개떼목장",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 안덕면 덕수리 1513-1",
        "code": "CE7"
    },
    {
        "x": "126.583087095477",
        "y": "33.253248590709",
        "name": "카페 요람",
        "phone": "010-9322-8453",
        "address_name": "제주특별자치도 서귀포시 토평동 759-1",
        "code": "CE7"
    },
    {
        "x": "126.680400784544",
        "y": "33.4367885904523",
        "name": "개스토랑",
        "phone": "",
        "address_name": "제주특별자치도 제주시 조천읍 교래리 552-4",
        "code": "CE7"
    },
    {
        "x": "126.540366917502",
        "y": "33.4742446979581",
        "name": "다같이애견카페",
        "phone": "070-8691-2475",
        "address_name": "제주특별자치도 제주시 아라일동 6050-1",
        "code": "CE7"
    },
    {
        "x": "126.513306025444",
        "y": "33.4712526853556",
        "name": "요기개",
        "phone": "",
        "address_name": "제주특별자치도 제주시 오라이동 843-5",
        "code": "CE7"
    },
    {
        "x": "126.293021407999",
        "y": "33.279486592594",
        "name": "제주애견카페왈 구억점",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 대정읍 구억리 306-12",
        "code": "CE7"
    },
    {
        "x": "126.530535710951",
        "y": "33.497624065375",
        "name": "비만고양이",
        "phone": "064-752-0501",
        "address_name": "제주특별자치도 제주시 이도2동 1185-11",
        "code": "CE7"
    }
]

