const place_data = [
    {
        "x": "126.363608985425",
        "y": "33.237243150763",
        "name": "늘바다애견동반펜션",
        "phone": "1833-9306",
        "address_name": "제주특별자치도 서귀포시 안덕면 창천리 901-6"
    },
    {
        "x": "126.762269746755",
        "y": "33.2920459749967",
        "name": "스테이반하나 애견동반펜션",
        "phone": "010-2074-0948",
        "address_name": "제주특별자치도 서귀포시 남원읍 태흥리 46-2"
    },
    {
        "x": "126.50302575748293",
        "y": "33.50365120681225",
        "name": "제주오케이렌터카",
        "phone": "064-743-4000",
        "address_name": "제주특별자치도 제주시 용담이동 737-3"
    },
    {
        "x": "126.834937957589",
        "y": "33.3681817543382",
        "name": "휘게애견팬션",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 성산읍 신풍리 600-3"
    },
    {
        "x": "126.43170029607377",
        "y": "33.49373365757327",
        "name": "외도339",
        "phone": "064-748-0339",
        "address_name": "제주특별자치도 제주시 외도이동 339"
    },
    {
        "x": "126.587278853649",
        "y": "33.2461387828309",
        "name": "라임오렌지빌",
        "phone": "064-767-3888",
        "address_name": "제주특별자치도 서귀포시 토평동 416"
    },
    {
        "x": "126.4141337709822",
        "y": "33.2484470023073",
        "name": "씨사이드아덴리조트",
        "phone": "064-731-9800",
        "address_name": "제주특별자치도 서귀포시 색달동 2864-32"
    },
    {
        "x": "126.91890542382357",
        "y": "33.43548966169358",
        "name": "랜딩커피",
        "phone": "070-8900-0998",
        "address_name": "제주특별자치도 서귀포시 성산읍 고성리 559-16"
    },
    {
        "x": "126.790794863817",
        "y": "33.5531575884987",
        "name": "달이뜨는식탁",
        "phone": "064-782-8538",
        "address_name": "제주특별자치도 제주시 구좌읍 월정리 885"
    },
    {
        "x": "126.80640163857548",
        "y": "33.55635478519352",
        "name": "그초록",
        "phone": "010-7777-4244",
        "address_name": "제주특별자치도 제주시 구좌읍 행원리 1485-8"
    },
    {
        "x": "126.49459941750798",
        "y": "33.49508807277879",
        "name": "제니의정원",
        "phone": "064-742-0649",
        "address_name": "제주특별자치도 제주시 연동 1934-1"
    },
    {
        "x": "126.52373372642265",
        "y": "33.50721989496874",
        "name": "아라팰리스호텔",
        "phone": "064-722-2788",
        "address_name": "제주특별자치도 제주시 삼도이동 228-32"
    },
    {
        "x": "126.36583112477697",
        "y": "33.410402001717785",
        "name": "통나무파크",
        "phone": "064-799-6909",
        "address_name": "제주특별자치도 제주시 애월읍 납읍리 102"
    },
    {
        "x": "126.601037980358",
        "y": "33.3257288024716",
        "name": "예이츠산장",
        "phone": "064-767-3846",
        "address_name": "제주특별자치도 서귀포시 남원읍 하례리 1876-1"
    },
    {
        "x": "126.42778368528352",
        "y": "33.26545653458881",
        "name": "제주에코스위츠",
        "phone": "064-738-9975",
        "address_name": "제주특별자치도 서귀포시 중문동 944-5"
    },
    {
        "x": "126.40767702404784",
        "y": "33.48505607635867",
        "name": "씨사이드 애월하귀점",
        "phone": "010-9932-9072",
        "address_name": "제주특별자치도 제주시 애월읍 하귀1리 1612"
    },
    {
        "x": "126.676999059308",
        "y": "33.2760210014731",
        "name": "동박낭",
        "phone": "",
        "address_name": "제주특별자치도 서귀포시 남원읍 위미리 956-3"
    },
    {
        "x": "126.8278472011442",
        "y": "33.5428463007221",
        "name": "오누이",
        "phone": "064-782-6801",
        "address_name": "제주특별자치도 제주시 구좌읍 한동리 1388-1"
    },
    {
        "x": "126.2955708289384",
        "y": "33.41088218348006",
        "name": "오데뜨",
        "phone": "064-799-2748",
        "address_name": "제주특별자치도 제주시 한림읍 상대리 2887"
    },
    {
        "x": "126.527675697577",
        "y": "33.47377864639875",
        "name": "탐나버거",
        "phone": "070-4038-0410",
        "address_name": "제주특별자치도 제주시 오등동 688-5"
    },
    {
        "x": "126.246757811701",
        "y": "33.3989469138154",
        "name": "어애랑",
        "phone": "064-796-9253",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 1510"
    },
    {
        "x": "126.302290416798",
        "y": "33.246951098309",
        "name": "신옛촌 본점",
        "phone": "064-794-1688",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 863-7"
    },
    {
        "x": "126.302062662303",
        "y": "33.4483996967658",
        "name": "심바카레",
        "phone": "064-799-4164",
        "address_name": "제주특별자치도 제주시 애월읍 금성리 472-5"
    },
    {
        "x": "126.241083771309",
        "y": "33.3918691333548",
        "name": "돼지굽는정원",
        "phone": "064-796-7531",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 2528"
    },
    {
        "x": "126.67265067446611",
        "y": "33.542854250199674",
        "name": "함덕해물라면오빠집",
        "phone": "064-784-6327",
        "address_name": "제주특별자치도 제주시 조천읍 함덕리 228-1"
    },
    {
        "x": "126.44668990628153",
        "y": "33.243372093041245",
        "name": "뷰티플하우스",
        "phone": "064-738-7407",
        "address_name": "제주특별자치도 서귀포시 대포동 1266"
    },
    {
        "x": "126.22493000358233",
        "y": "33.38819540081229",
        "name": "마레카펜션",
        "phone": "010-7283-1475",
        "address_name": "제주특별자치도 제주시 한림읍 금능리 1682-5"
    },
    {
        "x": "126.31520826145932",
        "y": "33.46333833285457",
        "name": "인디안썸머",
        "phone": "064-799-8444",
        "address_name": "제주특별자치도 제주시 애월읍 애월리 2127-10"
    },
    {
        "x": "126.50578142516332",
        "y": "33.254288086210956",
        "name": "봉꾸라주",
        "phone": "070-8866-1229",
        "address_name": "제주특별자치도 서귀포시 강정동 152-3"
    },
    {
        "x": "126.90179629537045",
        "y": "33.48598546517234",
        "name": "솔펜션",
        "phone": "0507-1474-0239",
        "address_name": "제주특별자치도 제주시 구좌읍 종달리 722"
    },
    {
        "x": "126.65721564391333",
        "y": "33.47342198226229",
        "name": "도을",
        "phone": "070-8844-0828",
        "address_name": "제주특별자치도 제주시 조천읍 와흘리 125"
    },
    {
        "x": "126.90743319793769",
        "y": "33.45492038317763",
        "name": "제주다온재",
        "phone": "064-784-5090",
        "address_name": "제주특별자치도 서귀포시 성산읍 오조리 1065-12"
    },
    {
        "x": "126.70344975434755",
        "y": "33.45974396240917",
        "name": "안녕토르",
        "phone": "010-2679-0475",
        "address_name": "제주특별자치도 제주시 조천읍 선흘리 1947-2"
    },
    {
        "x": "126.87973368187009",
        "y": "33.378833781483166",
        "name": "제이아일랜드카페",
        "phone": "064-782-7077",
        "address_name": "제주특별자치도 서귀포시 성산읍 신산리 421-1"
    },
    {
        "x": "126.363519961967",
        "y": "33.2370912230675",
        "name": "늘바다통나무펜션",
        "phone": "010-9061-3169",
        "address_name": "제주특별자치도 서귀포시 안덕면 창천리 901-6"
    },
    {
        "x": "126.89975655191883",
        "y": "33.50913071741252",
        "name": "크리스마스리조트",
        "phone": "064-733-5212",
        "address_name": "제주특별자치도 제주시 구좌읍 종달리 1422"
    },
    {
        "x": "126.385693882976",
        "y": "33.2421327739963",
        "name": "씨에나펜션",
        "phone": "064-739-6623",
        "address_name": "제주특별자치도 서귀포시 하예동 351-4"
    },
    {
        "x": "126.35581259666962",
        "y": "33.26102376627135",
        "name": "웨스티하우스",
        "phone": "064-792-2933",
        "address_name": "제주특별자치도 서귀포시 안덕면 감산리 210-5"
    },
    {
        "x": "126.171233164365",
        "y": "33.3417845716197",
        "name": "카페파람",
        "phone": "010-8520-0702",
        "address_name": "제주특별자치도 제주시 한경면 신창리 1353-1"
    },
    {
        "x": "126.33654670516285",
        "y": "33.43775551269634",
        "name": "푸르곤",
        "phone": "010-2482-8358",
        "address_name": "제주특별자치도 제주시 애월읍 납읍리 1024-6"
    },
    {
        "x": "126.84356930639566",
        "y": "33.32575883455676",
        "name": "당포로나인돈카츠",
        "phone": "070-8900-8285",
        "address_name": "제주특별자치도 서귀포시 표선면 표선리 43-1"
    },
    {
        "x": "126.3249561661",
        "y": "33.2420271360949",
        "name": "오션브릭풀빌라",
        "phone": "064-792-4100",
        "address_name": "제주특별자치도 서귀포시 안덕면 화순리 2021"
    },
    {
        "x": "126.1759331835639",
        "y": "33.34321150939524",
        "name": "와랑식탁",
        "phone": "010-4166-9501",
        "address_name": "제주특별자치도 제주시 한경면 신창리 1317-1"
    },
    {
        "x": "126.862901885372",
        "y": "33.4392632362505",
        "name": "금백조로가든",
        "phone": "064-782-2055",
        "address_name": "제주특별자치도 서귀포시 성산읍 수산리 2462-1"
    },
    {
        "x": "126.550733140133",
        "y": "33.252511088084",
        "name": "꼬라지오",
        "phone": "064-762-2297",
        "address_name": "제주특별자치도 서귀포시 서홍동 1153-6"
    },
    {
        "x": "126.84411488192542",
        "y": "33.43058195761508",
        "name": "샤론의집펜션",
        "phone": "010-8676-5948",
        "address_name": "제주특별자치도 서귀포시 성산읍 수산리 3988-9"
    },
    {
        "x": "126.509931891558",
        "y": "33.2420531931958",
        "name": "앙크레펜션",
        "phone": "064-738-8890",
        "address_name": "제주특별자치도 서귀포시 법환동 1027"
    },
    {
        "x": "126.64102908256382",
        "y": "33.26481425145401",
        "name": "호꼼스낵",
        "phone": "070-4132-5533",
        "address_name": "제주특별자치도 서귀포시 남원읍 신례리 58-1"
    },
    {
        "x": "126.794254260936",
        "y": "33.5583349288293",
        "name": "섯동네펜션",
        "phone": "010-7761-4517",
        "address_name": "제주특별자치도 제주시 구좌읍 월정리 659-1"
    },
    {
        "x": "126.53354990834",
        "y": "33.5030450044546",
        "name": "애플호텔",
        "phone": "064-725-1552",
        "address_name": "제주특별자치도 제주시 이도1동 1244-7"
    },
    {
        "x": "126.40140578718432",
        "y": "33.2587577329975",
        "name": "제주행복스케치펜션",
        "phone": "064-738-3720",
        "address_name": "제주특별자치도 서귀포시 상예동 283"
    },
    {
        "x": "126.24152105744949",
        "y": "33.39300059581983",
        "name": "배롱정원",
        "phone": "064-796-7766",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 2518"
    },
    {
        "x": "126.309750296371",
        "y": "33.2349074667293",
        "name": "바다스케치",
        "phone": "064-794-0030",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 150"
    },
    {
        "x": "126.36675746202916",
        "y": "33.449390704672915",
        "name": "오렌지슈가펜션",
        "phone": "064-799-7772",
        "address_name": "제주특별자치도 제주시 애월읍 하가리 120-49"
    },
    {
        "x": "126.282089220675",
        "y": "33.3463625749963",
        "name": "제주힐링리조트",
        "phone": "010-5415-9045",
        "address_name": "제주특별자치도 제주시 한림읍 금악리 3399"
    },
    {
        "x": "126.934831594063",
        "y": "33.4642875072665",
        "name": "바라봄",
        "phone": "010-9633-7072",
        "address_name": "제주특별자치도 서귀포시 성산읍 성산리 224-2"
    },
    {
        "x": "126.3128538010942",
        "y": "33.2352230845872",
        "name": "산방산해물라면오빠네",
        "phone": "010-8834-1798",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 171"
    },
    {
        "x": "126.910890423896",
        "y": "33.4610105874904",
        "name": "플라이오조",
        "phone": "064-783-2454",
        "address_name": "제주특별자치도 서귀포시 성산읍 오조리 792-1"
    },
    {
        "x": "126.25121062823803",
        "y": "33.380067524038836",
        "name": "소금빵까페 키친오즈",
        "phone": "064-796-7165",
        "address_name": "제주특별자치도 제주시 한림읍 협재리 958-1"
    },
    {
        "x": "126.29553137803309",
        "y": "33.23077408818657",
        "name": "쉬다가게",
        "phone": "010-8706-3606",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 2501-1"
    },
    {
        "x": "126.8076566194639",
        "y": "33.397428888296396",
        "name": "타이스토리",
        "phone": "064-787-4667",
        "address_name": "제주특별자치도 서귀포시 표선면 성읍리 458"
    },
    {
        "x": "126.794061435543",
        "y": "33.3832534709324",
        "name": "신토불이식당",
        "phone": "064-787-4450",
        "address_name": "제주특별자치도 서귀포시 표선면 성읍리 1380-3"
    },
    {
        "x": "126.58963352730993",
        "y": "33.249259007285694",
        "name": "비울채울펜션",
        "phone": "064-732-0388",
        "address_name": "제주특별자치도 서귀포시 보목동 1569"
    },
    {
        "x": "126.29973019846501",
        "y": "33.239548878430675",
        "name": "달콤한소금만들기",
        "phone": "010-2875-8250",
        "address_name": "제주특별자치도 서귀포시 안덕면 사계리 1545-1"
    },
    {
        "x": "126.583409853951",
        "y": "33.2483258649445",
        "name": "포시즌펜션",
        "phone": "064-732-5222",
        "address_name": "제주특별자치도 서귀포시 토평동 636"
    },
    {
        "x": "126.62437499094037",
        "y": "33.25885937055316",
        "name": "쇠소깍천일펜션",
        "phone": "1644-9565",
        "address_name": "제주특별자치도 서귀포시 남원읍 하례리 158-4"
    },
    {
        "x": "126.18346224715",
        "y": "33.3444693732521",
        "name": "일루올레",
        "phone": "0507-1421-5514",
        "address_name": "제주특별자치도 제주시 한경면 신창리 695-2"
    },
    {
        "x": "126.267470130405",
        "y": "33.3839061570874",
        "name": "메이플해피하우스",
        "phone": "064-796-4320",
        "address_name": "제주특별자치도 제주시 한림읍 명월리 1619-2"
    },
    {
        "x": "126.379460586078",
        "y": "33.4162708880183",
        "name": "멍멍플레이스",
        "phone": "0507-1307-4661",
        "address_name": "제주특별자치도 제주시 애월읍 소길리 952-2"
    },
    {
        "x": "126.396809354275",
        "y": "33.4341828015227",
        "name": "카페호나",
        "phone": "064-799-9114",
        "address_name": "제주특별자치도 제주시 애월읍 유수암리 2411"
    },
    {
        "x": "126.4843769197419",
        "y": "33.47142513609775",
        "name": "스시혼",
        "phone": "064-742-7006",
        "address_name": "제주특별자치도 제주시 노형동 88-16"
    },
    {
        "x": "126.3115349977728",
        "y": "33.416341677084354",
        "name": "봉성프리마",
        "phone": "010-2011-4430",
        "address_name": "제주특별자치도 제주시 애월읍 봉성리 4086"
    },
    {
        "x": "126.41606454600206",
        "y": "33.281455367763364",
        "name": "라벤더스호텔앤리조트",
        "phone": "064-739-0770",
        "address_name": "제주특별자치도 서귀포시 색달동 663"
    },
    {
        "x": "126.59281408922682",
        "y": "33.529584070123356",
        "name": "카페비비",
        "phone": "010-2659-8363",
        "address_name": "제주특별자치도 제주시 삼양일동 1577-14"
    },
    {
        "x": "126.35777722872983",
        "y": "33.472398115475976",
        "name": "엔젤하우스",
        "phone": "010-4894-9388",
        "address_name": "제주특별자치도 제주시 애월읍 고내리 11-1"
    }
]

